In [1]:
import pandas as pd
import plotly.express as px

In [3]:
data = pd.read_csv(r"C:\Users\DYNABOOK\Downloads\superstore_sales.csv")

In [17]:
data.head(0)

Empty DataFrame
Columns: [Order ID, Order Date, Ship Date, Customer ID, Customer Name, Segment, City, State, Region, Product Category, Sub-Category, Product Name, Sales, Quantity, Discount, Profit]
Index: []

In [20]:
data["Product Category"].unique()

array(['Office Supplies', 'Technology', 'Furniture'], dtype=object)

In [21]:
data["Product Category"].nunique()

3

In [22]:
data.groupby("Product Category")["Profit"].mean()

Product Category
Furniture          74.088054
Office Supplies    73.375824
Technology         77.901131
Name: Profit, dtype: float64

In [23]:
data.groupby("Product Name")["Quantity"].sum().nlargest(5)

Product Name
Product 1000    9
Product 1003    9
Product 1019    9
Product 1032    9
Product 1035    9
Name: Quantity, dtype: int64

In [24]:
data.groupby("State")["Profit"].sum().idxmax()

'TX'

In [25]:
data["Sub-Category"].value_counts()

Sub-Category
Accessories    1078
Phones         1036
Chairs          975
Binders         970
Tables          941
Name: count, dtype: int64

In [30]:
data["Profit Margin"] = data["Profit"] / data["Sales"]
data.head(0)

Empty DataFrame
Columns: [Order ID, Order Date, Ship Date, Customer ID, Customer Name, Segment, City, State, Region, Product Category, Sub-Category, Product Name, Sales, Quantity, Discount, Profit, Profit Margin]
Index: []

In [8]:
pivoted = data.pivot(index="Order ID", columns="Product Category", values="Sales")
pivoted

Product Category  Furniture  Office Supplies  Technology
Order ID
ORD10000                NaN           496.74         NaN
ORD10001                NaN              NaN      215.69
ORD10002             273.07              NaN         NaN
ORD10003             404.94              NaN         NaN
ORD10004             480.63              NaN         NaN
...                     ...              ...         ...
ORD14995             460.92              NaN         NaN
ORD14996                NaN              NaN      278.46
ORD14997                NaN           292.11         NaN
ORD14998                NaN              NaN      163.15
ORD14999                NaN              NaN      479.55

[5000 rows x 3 columns]

In [9]:
cross_tab = pd.crosstab(data["Region"], data["Product Category"])
cross_tab

Product Category  Furniture  Office Supplies  Technology
Region
Central                 410              423         424
East                    403              420         406
South                   432              386         420
West                    430              469         377

In [12]:
df1 = data[["Order ID", "Customer ID", "Sales"]]
df2 = data[["Customer ID", "Customer Name"]]
merged = pd.merge(df1, df2, on="Customer ID", how="inner")
merged

       Order ID Customer ID   Sales  Customer Name
0      ORD10000     CUST202  496.74     Customer 0
1      ORD10000     CUST202  496.74   Customer 525
2      ORD10000     CUST202  496.74   Customer 991
3      ORD10000     CUST202  496.74  Customer 2250
4      ORD10000     CUST202  496.74  Customer 4032
...         ...         ...     ...            ...
33461  ORD14998     CUST890  163.15  Customer 4998
33462  ORD14999     CUST973  479.55  Customer 1660
33463  ORD14999     CUST973  479.55  Customer 2297
33464  ORD14999     CUST973  479.55  Customer 3291
33465  ORD14999     CUST973  479.55  Customer 4999

[33466 rows x 4 columns]

merge without sort

In [14]:
merged_ordered = pd.merge_ordered(df1, df2, on="Customer ID")
merged_ordered

       Order ID Customer ID   Sales  Customer Name
0      ORD10815     CUST100  136.78   Customer 815
1      ORD10815     CUST100  136.78   Customer 951
2      ORD10815     CUST100  136.78  Customer 1233
3      ORD10815     CUST100  136.78  Customer 1434
4      ORD10815     CUST100  136.78  Customer 2461
...         ...         ...     ...            ...
33461  ORD14235     CUST998   25.02  Customer 2775
33462  ORD14235     CUST998   25.02  Customer 2938
33463  ORD14235     CUST998   25.02  Customer 3615
33464  ORD14235     CUST998   25.02  Customer 3829
33465  ORD14235     CUST998   25.02  Customer 4235

[33466 rows x 4 columns]

In [15]:
dummies = pd.get_dummies(data["Product Category"])
dummies

      Furniture  Office Supplies  Technology
0         False             True       False
1         False            False        True
2          True            False       False
3          True            False       False
4          True            False       False
...         ...              ...         ...
4995       True            False       False
4996      False            False        True
4997      False             True       False
4998      False            False        True
4999      False            False        True

[5000 rows x 3 columns]